var protocol = `一、合作协议的确认和接纳
唯尚广告联盟（www.visvn.cn）所提供的合作项目的所有权和运作权归唯尚广告联盟所有。您通过完成注册程序并点击选择“同意以下服务条款，提交注册信息”，表示您与唯尚广告联盟网站签订本合作协议（下称“本合作协议”）并接受所有相关条款的约束，以及表示您成为唯尚广告联盟的成员（“联盟成员”）。
二、 合作内容及费用说明
唯尚广告联盟成员注册成功后，即可登录系统，获得相关产品代码。联盟成员在其网站页面中嵌入其从系统中获得的产品代码后，该网站的访问者可以获得唯尚广告联盟提供的产品及/或相关服务。
唯尚广告联盟根据各种产品的不同计费方式统计带有联盟成员特征代码的产品流量，并按此流量向唯尚广告联盟成员支付相应合作费用。其各类产品收益模式及分成比例请登录后仔细阅读相关说明，合作费用支付以唯尚广告联盟（www.visvn.cn）网站上发布的标准为准，除非唯尚广告联盟与联盟成员间有另行约定并就此另行达成书面协议的。唯尚广告联盟有权根据联盟策略随时更改产品的收益模式、分成比例及结算策略，您在此同意始终遵守。

关于违规及作弊
加唯尚广告联盟的成员，必须自觉遵守本合作协议，如发现任何违规或作弊行为，唯尚广告联盟将停止付费并取消其联盟成员资格，同时保留进一步追究法律责任的权利。

联盟代码能且只能投放在联盟成员提交的域名下，否则被视为违规投放。若要在多个网站或域名下投放联盟代码，须在注册成功后，在“会员管理中心”中登记所有投放唯尚广告联盟代码的域名。

违规或作弊行为包含但不限于：
1. 任何形式的分拆代码：
联盟成员注册成功并经审核通过后，需要将从联盟获取的代码完整拷贝到相应页面，不能进行任何形式的代码分拆；
2. 通过人工及程序制造的无效点击提高流量：
1）当用户访问成员网站或鼠标经过联盟产品时，自动弹出联盟产品窗口；
2）通过代理服务器点击，互换点击等一切不产生任何效益的虚假无效点击；
3）其他无效点击形式；
3.
一切非正常投放的产品形式，一切以文字诱导或强制用户点击的行为：
1）非正当投放方式：
* 在无实质内容的页面全部投放唯尚广告联盟代码；
* 以电子邮件的形式制造产品点击； 
2）利用文字诱导、强制用户点击或下载：

如这样的描述：“点击此处，可成为本站VIP用户免费获得更多资源”

三、联盟成员的注册规则
1. 联盟成员的用户名的管理：
A、联盟成员的用户名的注册及使用须遵守中华人民共和国的有关法律法规、尊重网络道德；
B、联盟成员的用户名不得含有任何威胁、恐吓、漫骂、庸俗、亵渎、色情、淫秽、非法、攻击性、伤害性、骚扰性、诽谤性、辱骂性的或其他侵害他人合法权益的信息；
C、联盟成员不得以任何方式盗用、冒充他人用户名；
D、如联盟成员违反上述规定，应自行承担相应法律后果；唯尚广告联盟有权在必要时采取相应措施以维护相关合法权益。
2.
联盟成员的帐号、密码和安全性：您一旦注册成功并经唯尚广告联盟审核通过，成为唯尚广告联盟的合法成员，将得到一个密码和用户名。联盟成员将对用户名和密码安全负全部责任，且联盟成员对以其用户名在唯尚广告联盟进行的所有行为承担全部责任。联盟成员必须保管好自己的用户名和密码，谨防被盗或泄露；如因保管不善导致帐号和密码被盗或泄露，联盟成员自行承担相应后果。如果联盟成员在发现有任何非法使用联盟成员帐号或安全漏洞的情况，可以立即通告唯尚广告联盟以协助处理。
3.
提供详尽、准确的个人资料，并不断更新注册资料，符合及时、详尽、准确的要求。真实的联盟成员资料将作为唯尚广告联盟提供服务的依据和联盟成员获得法律保障的前提。若联盟成员提供的资料包含有不正确的信息，唯尚广告联盟保留停止向该联盟成员付费的权利，因虚假资料造成的任何损失，与唯尚广告联盟无关，唯尚广告联盟不负任何责任。

四、 隐私保护政策
每当联盟成员提供给唯尚广告联盟个人信息时，唯尚广告联盟会采取合理的步骤保护联盟成员的个人信息，唯尚广告联盟也会采取合理的安全手段保护已存储的个人信息。由于网上技术发展的突飞猛进，唯尚广告联盟会随时更新并公布唯尚广告联盟的信息保密制度，除非以下三种情况外，唯尚广告联盟不会在未经合法联盟成员授权时，公开、编辑或透露联盟成员资料及其它保存在唯尚广告联盟中的保密性内容：
1) 根据有关法律规定要求；
2) 有关权力机关要求；
3)
联盟成员授权（包括，如果联盟成员要求唯尚广告联盟提供特定服务时，唯尚广告联盟则需要把联盟成员的姓名和地址提供给与此相关联的第三方如邮政服务单位）。

五、 暂停与终止合作
唯尚广告联盟将根据联盟成员合作效果保留暂停或终止合作的权利。
任何经唯尚广告联盟确认已违反了合作协议的联盟成员，唯尚广告联盟有权决定是否给予其暂停或终止合作的处理，对屡犯者将立即给予暂停合作或终止合作的处理。
唯尚广告联盟保留其单方暂停或终止本合作协议的权利。但若唯尚广告联盟单方决定终止的，应提前一个月通知。通知做出的形式依据本合作协议第七条的规定。

六、 风险分担
联盟成员使用本网站将承担一定风险：唯尚广告联盟将不承担由于联盟成员自身过错、技术或其它不可控原因导致网站页面信息或其它方面的错误而给联盟成员造成的损失。

七、 通知
所有发给联盟成员的通知都将通过网站页面的公告或电子邮件传送。协议条款的修改、服务变更、或其它重要事件的通知都会以此形式进行。

八、 协议条款和资费标准的修改
唯尚广告联盟有权在必要时修改本合作协议条款的内容和合作资费标准，且该修改以符合国家法律法规的规定，并不侵害联盟成员的合法权益为必要前提。唯尚广告联盟合作协议条款一旦发生变动，唯尚广告联盟将在网页上公布修改内容。修改后的合作协议一旦在网页上公布即有效代替原来的合作协议。您可随时造访查阅最新版合作协议。联盟成员若不同意合作协议改动的内容，可以主动退出唯尚广告联盟；若唯尚广告联盟没有收到联盟成员书面通知，明确表示其退出唯尚广告联盟的，则视为该联盟成员选择继续享用唯尚广告联盟服务，已接受该协议条款的变动并受变动后协议条款的约束。

九、 法律适用
本合作协议条款应符合中华人民共和国法律法规的规定，联盟成员和唯尚广告联盟一致同意接受中华人民共和国法律的管辖。当本合作协议条款与中华人民共和国法律相抵触时，则这些条款将完全按法律规定重新解释或重新修订，而其它条款则依旧对唯尚广告联盟及联盟成员产生法律效力。

十、 争议解决
与本合作协议有关的一切争议，双方应通过协商方式友好解决；如协商未果，应将争议提交北京仲裁委员会进行仲裁，该仲裁结果是终局的并对双方均有约束力。

十一、唯尚广告联盟欢迎联盟成员对网站服务条款给予评论或提出质疑。
唯尚广告联盟 将根据网站发展的需求和技术的发展不断完善本合作协议。
警告： 
对任何违反国家法律和唯尚广告联盟网站相应管理规定且侵害了唯尚广告联盟网站合法权益的行为，唯尚广告联盟将保留追究其法律责任的权利。`
var aboutMsg = "青岛千智网络科技有限公司，是一家专注于互联网广告及网络营销领域的互联网营销公司，有着非常丰富的网络广告和网络策划经验，专注于网络广告的研究与发展，为客户提供各种形式的网络广告投放服务。旗下的唯尚广告联盟对垂直行业门户站点及娱乐性、交友性等网站有着丰富的运营经验。通过不断的努力，在国内网络广告领域已经享有良好的声誉以及品牌。我们将本着“用专业的心，做专业的事”的工作原则，在良好的管理体系下，始终坚持“质优价廉”的产品价格体系，为客户真正做到省心，省钱。"
export default {protocol,aboutMsg}